sgbd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2024-10-17 qui 08:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SGBD</title>
<meta name="author" content="Jackson de Jesus" />
<meta name="description" content="Resumo dos conceitos de SGBD" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<!-- <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/> -->
<!---->
</head>
<body>
<div id="content" class="content">
<h1 class="title">SGBD</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Capítulos</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org174b90c">Capítulo 1</a></li>
<li><a href="#org93d82a8">Capítulo 2</a></li>
<li><a href="#org85564e4">Capítulo 3</a></li>
<li><a href="#org9fc587f">Capítulo 4</a></li>
<li><a href="#orge6722fa">Capítulo 5</a></li>
<li><a href="#org29e569b">Capítulo 6</a></li>
<li><a href="#org4022d49">Observações&#x2026;</a>
<ul>
<li><a href="#org23d6472">Como organizei o conteúdo desta página</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6c377d4">Voltar para o início&#x2026;</a></div>
</div>

<div id="outline-container-org174b90c" class="outline-3">
<h3 id="org174b90c">Capítulo 1</h3>
<div class="outline-text-3" id="text-org174b90c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>SGBD</b></b></td>
<td class="org-left">Um software que gerencia a estrutura de um banco de dados, controlando o acesso dos usuários, gerenciando cópias de dados, disponibilidade, distribuição e integridade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Funções de um SGBD</b></b></td>
<td class="org-left">As cinco funções principais de um SGBD são: gerenciar acesso compartilhado aos dados; atribuir permissões de acesso aos usuários; realizar cópias do banco de dados; adicionar regras e padrões nas estruturas de armazenamento; permitir a recuperação dos dados armazenados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Componentes de um SGBD</b></b></td>
<td class="org-left">Os componentes de um SGBD incluem: Pré-compilador DML, Compilador DML, Interpretador DDL, Gerenciador de permissões DCL, Gerenciador de integridade, Gerenciador de transição, Gerenciador de arquivos e Gerenciador de buffer.</td>
</tr>

<tr>
<td class="org-left"><b><b>Schemas</b></b></td>
<td class="org-left">Estruturas que representam uma visualização geral do banco de dados, estabelecendo como os dados são organizados e interligados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de Schemas</b></b></td>
<td class="org-left">Esquema físico (nível interno), esquema lógico (nível conceitual) e esquema de visão (nível externo).</td>
</tr>

<tr>
<td class="org-left"><b><b>Instâncias</b></b></td>
<td class="org-left">Conjuntos de informações definidas por um esquema, criadas durante operações de inserção, alteração ou exclusão de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Linguagens de Manipulação de Dados</b></b></td>
<td class="org-left">DML (Data Manipulation Language), DDL (Data Definition Language) e DCL (Data Control Language).</td>
</tr>

<tr>
<td class="org-left"><b><b>Funções de um SGBD</b></b></td>
<td class="org-left">Segurança, controle de acesso, controle de redundância e controle de concorrência.</td>
</tr>

<tr>
<td class="org-left"><b><b>Vantagens de um SGBD</b></b></td>
<td class="org-left">Gerenciamento flexível do banco de dados, fácil acesso e visualização dos dados, segurança de acesso, minimização de inconsistências de dados e fácil integração de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Desvantagens de um SGBD</b></b></td>
<td class="org-left">Alto custo de licença e hardware, complexidade operacional que exige técnicos especializados, performance dependente de hardware e possível impacto na performance de outros aplicativos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Controle de Concorrência</b></b></td>
<td class="org-left">Mecanismo que impede mudanças simultâneas no mesmo objeto por múltiplos usuários para evitar problemas com os dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Classificação de SGBDs</b></b></td>
<td class="org-left">SGBDs podem ser classificados quanto ao número de usuários (monousuários ou multiusuários), ambiente (homogêneo ou heterogêneo) e localização (localizado ou distribuído).</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de Banco de Dados</b></b></td>
<td class="org-left">Banco de dados relacional e banco de dados não relacional (NoSQL).</td>
</tr>

<tr>
<td class="org-left"><b><b>Banco de Dados Relacional</b></b></td>
<td class="org-left">Armazena dados em colunas e linhas, utilizando a linguagem SQL para manipulação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Banco de Dados Não Relacional (NoSQL)</b></b></td>
<td class="org-left">Utilizado para manipular dados não estruturados, como vídeos, imagens e gráficos, utilizando a linguagem NoSQL.</td>
</tr>

<tr>
<td class="org-left"><b><b>Exemplos de Bancos de Dados NoSQL</b></b></td>
<td class="org-left">Redis, Cassandra, MongoDB, Memcached, Neo4j, Amazon DynamoDB e HBase.</td>
</tr>

<tr>
<td class="org-left"><b><b>Principais SGBDs Relacionais</b></b></td>
<td class="org-left">Oracle Database, MySQL, SQL Server e PostgreSQL.</td>
</tr>

<tr>
<td class="org-left"><b><b>DBA (Administrador de Banco de Dados)</b></b></td>
<td class="org-left">Profissional responsável pela instalação, criação, monitoramento, manutenção e análise de SGBDs e bancos de dados.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org93d82a8" class="outline-3">
<h3 id="org93d82a8">Capítulo 2</h3>
<div class="outline-text-3" id="text-org93d82a8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Banco de Dados</b></b></td>
<td class="org-left">Uma coleção organizada de dados inter-relacionados que geram significado e se transformam em informação.</td>
</tr>

<tr>
<td class="org-left"><b><b>SGBD (Sistema Gerenciador de Banco de Dados)</b></b></td>
<td class="org-left">Software que administra a estrutura de um banco de dados, incluindo segurança, integridade, controle de concorrência e recuperação de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>DBA (Administrador de Banco de Dados)</b></b></td>
<td class="org-left">Profissional responsável por gerenciar e otimizar o banco de dados, incluindo tarefas como backups, restaurações e gerenciamento de usuários.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tabelas do Sistema</b></b></td>
<td class="org-left">Estruturas auxiliares que armazenam metadados (dados sobre os dados) do banco de dados, como nomes de tabelas e colunas.</td>
</tr>

<tr>
<td class="org-left"><b><b>DMV (Views de Gerenciamento Dinâmico)</b></b></td>
<td class="org-left">Conjunto de informações que monitoram o comportamento do SGBD, fornecendo insights sobre desempenho, uso de recursos e outros aspectos importantes para o DBA.</td>
</tr>

<tr>
<td class="org-left"><b><b>Backup</b></b></td>
<td class="org-left">Cópia de segurança do banco de dados para proteger contra perda de dados em caso de falhas de hardware, erros humanos, ataques cibernéticos ou desastres naturais.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de Backup</b></b></td>
<td class="org-left">* <b><b>Backup Completo (Full):</b></b> Cópia integral de todos os dados do banco.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">* <b><b>Backup Parcial:</b></b> Cópia de apenas uma parte dos dados, como backups diferenciais (alterações desde o último backup completo) ou backups de log (registros de transações).</td>
</tr>

<tr>
<td class="org-left"><b><b>Restore</b></b></td>
<td class="org-left">Processo de restauração dos dados a partir de um backup, essencial para recuperar dados perdidos ou corrompidos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Segurança de Dados</b></b></td>
<td class="org-left">Medidas para proteger os dados contra acessos não autorizados e garantir a confidencialidade, integridade e disponibilidade dos dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Integridade de Dados</b></b></td>
<td class="org-left">Característica que garante que os dados sejam consistentes e precisos ao longo de seu ciclo de vida. Tipos de integridade: física, lógica (entidade, referencial, domínio e definida pelo usuário).</td>
</tr>

<tr>
<td class="org-left"><b><b>Controle de Concorrência</b></b></td>
<td class="org-left">Gerenciamento de múltiplos acessos simultâneos ao banco de dados para evitar conflitos e inconsistências nos dados. Utiliza técnicas como serialização e propriedades ACID.</td>
</tr>

<tr>
<td class="org-left"><b><b>Propriedades ACID</b></b></td>
<td class="org-left">Conjunto de propriedades que garantem a confiabilidade das transações em um SGBD: Atomicidade, Consistência, Isolamento e Durabilidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Regra 3-2-1 para Backups</b></b></td>
<td class="org-left">Recomendação de boas práticas para backups, sugerindo 3 cópias, em 2 tipos de mídia diferentes, com 1 cópia fora do local.</td>
</tr>
</tbody>
</table>
</div>
</div>
