sgbd.html

<div id="outline-container-org85564e4" class="outline-3">
<h3 id="org85564e4">Capítulo 3</h3>
<div class="outline-text-3" id="text-org85564e4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Análise de Desempenho de SGBD</b></b></td>
<td class="org-left">Avaliação do desempenho de um SGBD, crucial para garantir acesso eficaz aos dados e identificar gargalos, considerando fatores como hardware, sistema operacional, configuração do SGBD, volume de dados e número de usuários.</td>
</tr>

<tr>
<td class="org-left"><b><b>Otimização de Desempenho de SGBD</b></b></td>
<td class="org-left">Conjunto de práticas para aprimorar o desempenho de um SGBD, incluindo: manter o SGBD atualizado, remover tabelas órfãs, otimizar o carregamento automático de dados e realizar expurgo de dados antigos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Confidencialidade de Dados</b></b></td>
<td class="org-left">Princípio fundamental da segurança da informação que visa proteger os dados contra acesso não autorizado e garantir que apenas usuários autorizados tenham acesso às informações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ameaças à Segurança da Informação</b></b></td>
<td class="org-left">Ações ou eventos que podem comprometer a confidencialidade, integridade e disponibilidade dos dados. Exemplos: falhas humanas, malware (ransomware, spyware), ataques direcionados, ataques persistentes avançados e ataques DDoS.</td>
</tr>

<tr>
<td class="org-left"><b><b>Gestão de Segurança de Dados</b></b></td>
<td class="org-left">Conjunto de práticas e medidas implementadas para proteger os dados em um SGBD, visando garantir a integridade, disponibilidade e confidencialidade das informações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Certificado Digital</b></b></td>
<td class="org-left">Identidade eletrônica que garante a autenticidade e a integridade de transações eletrônicas, utilizando criptografia e um par de chaves (privada e pública).</td>
</tr>

<tr>
<td class="org-left"><b><b>Criptografia</b></b></td>
<td class="org-left">Técnica para proteger a confidencialidade e a integridade das informações, transformando os dados em um formato ilegível para pessoas não autorizadas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Disponibilidade de Dados</b></b></td>
<td class="org-left">Capacidade de acesso aos dados quando necessário, garantindo que os dados estejam disponíveis para usuários e sistemas em tempo hábil.</td>
</tr>

<tr>
<td class="org-left"><b><b>Integridade de Dados</b></b></td>
<td class="org-left">Consistência, precisão e confiabilidade dos dados ao longo do seu ciclo de vida, assegurando que os dados não sejam corrompidos ou alterados indevidamente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Auditoria de Banco de Dados</b></b></td>
<td class="org-left">Processo sistemático para examinar as atividades e configurações de um SGBD, buscando garantir a conformidade com políticas de segurança, leis e regulamentações.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9fc587f" class="outline-3">
<h3 id="org9fc587f">Capítulo 4</h3>
<div class="outline-text-3" id="text-org9fc587f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Manutenção de SGBD</b></b></td>
<td class="org-left">Conjunto de atividades para garantir o bom funcionamento de um banco de dados, incluindo backups, exportação/importação de dados, revisão de índices, exclusão de objetos, expurgo de dados antigos, e atualizações para acomodar novas tecnologias e evitar riscos de segurança. A manutenção visa manter os dados em boas condições, protegendo-os contra acesso não autorizado e garantindo sua disponibilidade e eficiência.</td>
</tr>

<tr>
<td class="org-left"><b><b>Importação/Exportação de Dados</b></b></td>
<td class="org-left">Processos que permitem a transferência de dados entre bancos de dados, seja no mesmo SGBD ou em diferentes. A importação envolve carregar dados de um arquivo para um banco, enquanto a exportação cria um arquivo com os dados do banco. Ferramentas como o MySQL Workbench facilitam esses processos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Replicação de Dados</b></b></td>
<td class="org-left">Técnica para copiar e distribuir dados de um banco de dados (master) para um ou mais bancos de dados (slave). A replicação oferece benefícios como redundância de dados, tolerância a falhas, balanceamento de carga e backup, embora não deva ser a única opção de backup.</td>
</tr>

<tr>
<td class="org-left"><b><b>Migração de Dados</b></b></td>
<td class="org-left">Processo complexo de transferir dados entre diferentes SGBDs. A complexidade aumenta com a diversidade de bases de dados e tipos de dados. A migração pode envolver o uso de drivers ODBC, arquivos de texto separados por vírgulas ou scripts para adaptar os dados ao novo SGBD.</td>
</tr>

<tr>
<td class="org-left"><b><b>Verificação de Ocupação de Espaço em Disco</b></b></td>
<td class="org-left">Monitoramento do espaço em disco disponível para o SGBD, crucial para o seu bom funcionamento. O MySQL realiza verificações regulares para garantir espaço suficiente para gravação de dados. Comandos como TRUNCATE TABLE podem liberar espaço em disco devolvendo-o ao sistema operacional.</td>
</tr>

<tr>
<td class="org-left"><b><b>Gerenciamento de E/S de Disco</b></b></td>
<td class="org-left">Administração da entrada e saída de dados do disco para evitar a saturação do subsistema de E/S e gerenciar o espaço em disco, impedindo que os dispositivos de armazenamento fiquem cheios.</td>
</tr>
</tbody>
</table>
</div>
</div>
