sgbd.html

<div id="outline-container-orge6722fa" class="outline-3">
<h3 id="orge6722fa">Capítulo 5</h3>
<div class="outline-text-3" id="text-orge6722fa">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Normalização de Dados</b></b></td>
<td class="org-left">Conjunto de regras para organizar o projeto de um banco de dados, com o objetivo de reduzir a redundância e aumentar a integridade e o desempenho.</td>
</tr>

<tr>
<td class="org-left"><b><b>Formas Normais</b></b></td>
<td class="org-left">Regras de normalização que visam simplificar e adequar as tabelas de um banco de dados relacional, evitando anomalias em inclusão, exclusão e alteração de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>1FN (Primeira Forma Normal)</b></b></td>
<td class="org-left">Define que os atributos devem ser atômicos, sem valores repetidos ou atributos multivalorados.</td>
</tr>

<tr>
<td class="org-left"><b><b>2FN (Segunda Forma Normal)</b></b></td>
<td class="org-left">Atributos não-chave devem depender unicamente da chave primária da entidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>3FN (Terceira Forma Normal)</b></b></td>
<td class="org-left">Todos os atributos devem ser funcionalmente independentes uns dos outros e dependentes apenas da chave primária.</td>
</tr>

<tr>
<td class="org-left"><b><b>4FN (Quarta Forma Normal)</b></b></td>
<td class="org-left">Impede dependências multivaloradas não triviais de conjuntos de atributos em algo além de um superconjunto de uma chave candidata.</td>
</tr>

<tr>
<td class="org-left"><b><b>5FN (Quinta Forma Normal)</b></b></td>
<td class="org-left">Exige que não haja dependências de joins (associações) não triviais que não venham de restrições-chave. Atributos compostos que podem ser subdivididos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Controle de Concorrência</b></b></td>
<td class="org-left">Gerenciamento do acesso simultâneo de múltiplos usuários aos mesmos dados em um banco de dados, evitando inconsistências.</td>
</tr>

<tr>
<td class="org-left"><b><b>Serialização</b></b></td>
<td class="org-left">Execução de transações de forma serial, garantindo o isolamento e evitando interferências entre operações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Transação</b></b></td>
<td class="org-left">Conjunto de operações executadas entre o início e o fim de uma operação de manutenção de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Propriedades ACID</b></b></td>
<td class="org-left">Atomicidade, Consistência, Isolamento e Durabilidade, princípios que garantem a confiabilidade das transações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Atomicidade</b></b></td>
<td class="org-left">A transação é uma unidade indivisível, sendo executada por completo ou desfeita totalmente em caso de falha.</td>
</tr>

<tr>
<td class="org-left"><b><b>Consistência</b></b></td>
<td class="org-left">A transação leva o banco de dados de um estado consistente para outro, sem interferências durante a execução.</td>
</tr>

<tr>
<td class="org-left"><b><b>Isolamento</b></b></td>
<td class="org-left">Cada transação é executada de forma isolada, sem interferência de outras transações simultâneas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Durabilidade</b></b></td>
<td class="org-left">As alterações realizadas por uma transação completada com sucesso persistem no banco de dados, mesmo em caso de falhas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bloqueio em Duas Fases</b></b></td>
<td class="org-left">Técnica de controle de concorrência que utiliza bloqueios para garantir acesso exclusivo a dados durante uma transação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bloqueio Compartilhado</b></b></td>
<td class="org-left">Permite que múltiplas transações leiam os mesmos dados, mas impede gravações simultâneas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bloqueio Exclusivo</b></b></td>
<td class="org-left">Reserva o acesso exclusivo a um dado para uma única transação, impedindo qualquer outro acesso.</td>
</tr>

<tr>
<td class="org-left"><b><b>Deadlock</b></b></td>
<td class="org-left">Situação em que duas ou mais transações ficam bloqueadas indefinidamente, aguardando a liberação de recursos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Starvation</b></b></td>
<td class="org-left">Uma transação é continuamente preterida na fila de espera por recursos, impossibilitando sua conclusão.</td>
</tr>

<tr>
<td class="org-left"><b><b>Otimização de Consultas</b></b></td>
<td class="org-left">Processo de identificar e eliminar gargalos de desempenho em consultas SQL, buscando a execução mais rápida possível.</td>
</tr>

<tr>
<td class="org-left"><b><b>Slow Log</b></b></td>
<td class="org-left">Recurso do MySQL que registra consultas com tempo de execução superior a um limite definido, auxiliando na identificação de problemas de performance.</td>
</tr>

<tr>
<td class="org-left"><b><b>Comando EXPLAIN</b></b></td>
<td class="org-left">Exibe o plano de execução de uma consulta SQL, permitindo analisar o processo de otimização e identificar possíveis melhorias.</td>
</tr>

<tr>
<td class="org-left"><b><b>Índices</b></b></td>
<td class="org-left">Estruturas que organizam os dados em uma tabela, acelerando a busca e recuperação de informações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Cardinalidade</b></b></td>
<td class="org-left">Número de registros distintos em um índice, impactando a eficiência da busca.</td>
</tr>
</tbody>
</table>
</div>
</div>
