sgbd.html

<div id="outline-container-org29e569b" class="outline-3">
<h3 id="org29e569b">Capítulo 6</h3>
<div class="outline-text-3" id="text-org29e569b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Conceito</td>
<td class="org-left">Descrição</td>
</tr>

<tr>
<td class="org-left">Banco de Dados Distribuídos (BDD)</td>
<td class="org-left">Um conjunto de servidores interconectados que armazenam e gerenciam dados de forma distribuída. Permite acesso ordenado e aleatório aos dados, que podem estar localizados em diferentes servidores (nós).</td>
</tr>

<tr>
<td class="org-left">Replicação de Dados</td>
<td class="org-left">Uma característica dos BDDs onde os dados são copiados e mantidos em múltiplos servidores, garantindo redundância e disponibilidade. Essencial para o funcionamento dos BDDs.</td>
</tr>

<tr>
<td class="org-left">Fragmentação de Dados</td>
<td class="org-left">Divisão dos dados em partes menores para serem distribuídas entre os servidores. Pode ser horizontal (divisão por linhas) ou vertical (divisão por colunas). Permite reconstruir a relação original a partir dos fragmentos.</td>
</tr>

<tr>
<td class="org-left">Data Warehouse</td>
<td class="org-left">Repositório central de dados de diversas fontes, utilizado para análise de negócios e tomada de decisões. Os dados são carregados periodicamente e disponibilizados apenas para leitura, sem permissão para alterações.</td>
</tr>

<tr>
<td class="org-left">ETL</td>
<td class="org-left">Processo de Extração, Transformação e Carregamento de dados utilizado para integrar dados de diferentes fontes em um data warehouse.</td>
</tr>

<tr>
<td class="org-left">ELT</td>
<td class="org-left">Variante do ETL que realiza a Transformação dos dados após o Carregamento, visando melhorar a performance.</td>
</tr>

<tr>
<td class="org-left">Data Lake</td>
<td class="org-left">Repositório de dados estruturados e não estruturados de diversas fontes, mantido em sua forma original. Permite análises avançadas e mineração de dados. Os dados são preparados apenas quando acessados pelos usuários.</td>
</tr>

<tr>
<td class="org-left">Marketing Multicanal</td>
<td class="org-left">Abordagem de marketing que integra todos os pontos de contato com o cliente em diferentes canais, utilizando um data lake para consolidar os dados de cada canal e ponto de contato.</td>
</tr>

<tr>
<td class="org-left">Hadoop</td>
<td class="org-left">Plataforma de processamento de big data baseada em arquivos, comumente utilizada como base para data lakes. Oferece escalabilidade linear a baixo custo e recursos avançados de processamento.</td>
</tr>

<tr>
<td class="org-left">NoSQL</td>
<td class="org-left">Sistema de gerenciamento de banco de dados não relacional, alternativo ao SQL. Oferece maior robustez e escalabilidade, sendo ideal para lidar com grandes volumes de dados semiestruturados ou não tratados.</td>
</tr>

<tr>
<td class="org-left">Processamento Paralelo</td>
<td class="org-left">Divisão de tarefas em partes menores que são executadas simultaneamente em múltiplos processadores, aumentando a eficiência do processamento de grandes volumes de dados. Essencial para o bom desempenho dos sistemas NoSQL.</td>
</tr>

<tr>
<td class="org-left">Ciência de Dados</td>
<td class="org-left">Área que se dedica à coleta, análise e interpretação de dados para auxiliar no crescimento dos negócios. Utiliza ferramentas e técnicas para extrair insights e gerar valor a partir dos dados.</td>
</tr>

<tr>
<td class="org-left">Funções da Ciência de Dados</td>
<td class="org-left">Envolve coleta, armazenamento, preparação, análise e divulgação de dados, com foco em responder a perguntas gerenciais e gerar insights para a tomada de decisões.</td>
</tr>

<tr>
<td class="org-left">Aplicações da Ciência de Dados</td>
<td class="org-left">Diversas áreas como meteorologia (previsão do tempo), análise de clientes, saúde (diagnósticos médicos), logística (otimização de rotas) e marketing (personalização de anúncios e recomendações).</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4022d49" class="outline-3">
<h3 id="org4022d49">Observações&#x2026;</h3>
<div class="outline-text-3" id="text-org4022d49">
</div>
<div id="outline-container-org23d6472" class="outline-4">
<h4 id="org23d6472">Como organizei o conteúdo desta página</h4>
<div class="outline-text-4" id="text-org23d6472">
<p>
Esta página contém resumos dos principais conceitos da disciplina sistema gerenciador de banco de dados, extraídos de arquivos no formato PDF com a ferramenta <a href="https://notebooklm.google.com">NotebookLM</a>.
</p>

<p>
De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:
</p>

<p>
<b>Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.</b>
</p>

<p>
A partir do segundo pedido, usei o comando:
</p>

<p>
<b>Repita o processo anterior para este texto.</b>
</p>

<p>
No terceiro pedido, recebi a mensage de:
</p>

<p>
<b>O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.</b>
</p>

<p>
Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:
</p>

<p>
<b>Refaça a tabela para uma melhor formatação em Markdown.</b>
</p>

<p>
A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.
</p>
</div>
</div>
</div>

<div id="outline-container-org6c377d4" class="outline-2">
<h2 id="org6c377d4"><a href="./index.html">Voltar para o início&#x2026;</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jackson de Jesus</p>
<p class="date">Created: 2024-10-17 qui 08:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
